### Series
- är en endimentionell array av vilken datatyp som helst

In [19]:
import pandas as pd

fruits = pd.Series(["kiwi", "kumqwat", "banan", "melon", "mango", "apple", "strawberry"], index=["a", "b", "c", "d", "e", "f", "g"])
numbers = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])

numbers[numbers > 5]

5    6
6    7
7    8
8    9
dtype: int64

### Dataframe
- är en tvådimentionell datastruktur

- **Framförallt detta vi kommer jobba med!**

In [30]:
data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Location": ["New York", "Paris", "Berlin", "London"],
    "Age": [24, 13, 53, 33],
}

df = pd.DataFrame(data)
df

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [34]:
age = df["Age"]
datingregler = age / 2 + 7
datingregler

0    19.0
1    13.5
2    33.5
3    23.5
Name: Age, dtype: float64

In [35]:
df[df["Age"] > 30]

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33

In [36]:
str(df)

'    Name  Location  Age\n0   John  New York   24\n1   Anna     Paris   13\n2  Peter    Berlin   53\n3  Linda    London   33'